zlgopen/ametal/soc/hdsc/hc32f07x/hc32f07x_pin.h
/**
 * \name PIOF_7引脚复用功能
 * @{
 */
#define PIOF_7_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)
#define PIOF_7_I2C1_SDA       AM_HC32_GPIO_REMAP_CODE(0x06, 1)
#define PIOF_7_LPUART1_RTS    AM_HC32_GPIO_REMAP_CODE(0x06, 2)
#define PIOF_7_UART0_RTS      AM_HC32_GPIO_REMAP_CODE(0x06, 3)

/** @} */

/**
 * \name PIOF_7引脚复用时功能模式
 * @{
 */
#define PIOF_7_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOF_7_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOF_7_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOF_7_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOF_7_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOF_7_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOF_7_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOF_9引脚复用功能
 * @{
 */
#define PIOF_9_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)
#define PIOF_9_TIM0_CHA       AM_HC32_GPIO_REMAP_CODE(0x06, 1)

/** @} */

/**
 * \name PIOF_9引脚复用时功能模式
 * @{
 */
#define PIOF_9_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOF_9_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOF_9_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOF_9_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOF_9_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOF_9_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOF_9_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOF_10引脚复用功能
 * @{
 */
#define PIOF_10_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)
#define PIOF_10_TIM0_CHB       AM_HC32_GPIO_REMAP_CODE(0x06, 1)

/** @} */

/**
 * \name PIOF_10引脚复用时功能模式
 * @{
 */
#define PIOF_10_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOF_10_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOF_10_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOF_10_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOF_10_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOF_10_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOF_10_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOF_11引脚复用功能
 * @{
 */
#define PIOF_11_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)

/** @} */

/**
 * \name PIOF_11引脚复用时功能模式
 * @{
 */
#define PIOF_11_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOF_11_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOF_11_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOF_11_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOF_11_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOF_11_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOF_11_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/******************************************************************************/

/**
 * @}
 */

/**
 * @}if_hc32_pin
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32_PIN_H */

/* end of file */
